{
  "Count": 10,
  "Paragraph": [
    {
      "IdParagraph": 0,
      "TextParagraph": "In the city of Neverwinter, a dwarf named Gundren Rockseeker asked you to bring a wagon load of provisions to the rough-and-tumble settlement of Phandalin, a couple of days' travel southeast of the city. \r\nGundren was clearly excited and more than a little secretive about his reasons for the trip, saying only that he and his brothers had found \"something big,\" and that he'd pay you ten gold pieces each for escorting his supplies safely to Barthen's Provisions, a trading post in Phandalin. \r\nHe then set out ahead of you on horse, along with a warrior escort named Sildar Haliwinter, claiming he needed to arrive early to \"take care of business.\"\r\nYou've spent the last few days following the High Road south from Neverwinter, and you've just recently veered east along the Triboar Trail. \r\nYou've encountered no trouble so far, but this territory can be dangerous. \r\nBandits and outlaws have been known to lurk along the trail.",
      "HowManyOptions": 2,
      "NextParagraph": [
        {
          "ChoiceText": "What's on the cart?",
          "IdParagraph": 1
        },
        {
          "ChoiceText": "Next",
          "IdParagraph": 2
        }
      ]
    },
    {
      "IdParagraph": 1,
      "TextParagraph": "The wagon is packed full of an assortment of mining supplies and food. This includes a dozen sacks of flour, several casks ofsalted pork, two kegs ofstrong ale, shovels, picks, and crowbars (about a dozen each), and five lanterns with a small barrel of oil (about fiftyflasks in volume). \nThe total value of the cargo is 100 gp.",
      "HowManyOptions": 1,
      "NextParagraph": [
        {
          "ChoiceText": "Next",
          "IdParagraph": 2
        }
      ]
    },
    {
      "IdParagraph": 2,
      "TextParagraph": "You've been on the Triboar Trail for about half a day. \nAs you come around a bend, you spot two dead horses sprawled about fifty feet ahead of you, blocking the path. \nEach has several black-feathered arrows sticking out of it. \nThe woods press close to the trail here, with a steep embankment and dense thickets on either side.",
      "HowManyOptions": 2,
      "NextParagraph": [
        {
          "ChoiceText": "Look around",
          "IdParagraph": 3
        },
        {
          "ChoiceText": "Come closer",
          "IdParagraph": 4
        }
      ]
    },
    {
      "IdParagraph": 3,
      "TextParagraph": "(In the future) Test on perception - Player vs Goblin",
      "HowManyOptions": 2,
      "NextParagraph": [
        {
          "ChoiceText": "Ture",
          "IdParagraph": 1
        },
        {
          "ChoiceText": "False",
          "IdParagraph": 2
        }
      ]
    },
    {
      "IdParagraph": 4,
      "TextParagraph": "The horses as belonging to Gundren Rockseeker and Sildar Hallwinter. They've been dead about a day, and it's clear that arrows killed the horses.",
      "HowManyOptions": 1,
      "NextParagraph": [
        {
          "ChoiceText": "Get closer to the dead horses",
          "IdParagraph": 6
        }
      ]
    },
    {
      "IdParagraph": 5,
      "TextParagraph": "Two goblins are hiding in the woods, one on each side of the road.",
      "HowManyOptions": 2,
      "NextParagraph": [
        {
          "ChoiceText": "Get closer to the dead horses",
          "IdParagraph": 6
        },
        {
          "ChoiceText": "Attack",
          "IdParagraph": 7
        }
      ]
    },
    {
      "IdParagraph": 6,
      "TextParagraph": "The saddlebags have been looted. Nearby lies an empty 1 leather map case.",
      "HowManyOptions": 1,
      "NextParagraph": [
        {
          "ChoiceText": "Next",
          "IdParagraph": 7
        }
      ]
    },
    {
      "IdParagraph": 7,
      "TextParagraph": "(In the future) Fight with 2 goblin",
      "HowManyOptions": 2,
      "NextParagraph": [
        {
          "ChoiceText": "Victory",
          "IdParagraph": 8
        },
        {
          "ChoiceText": "Defeat",
          "IdParagraph": 999
        }
      ]
    },
    {
      "IdParagraph": 8,
      "TextParagraph": "You are looking at two dead goblins.",
      "HowManyOptions": 2,
      "NextParagraph": [
        {
          "ChoiceText": "Look Around",
          "IdParagraph": 9
        },
        {
          "ChoiceText": "(In the future) Recorver",
          "IdParagraph": 998
        }
      ]
    },
    {
      "IdParagraph": 9,
      "TextParagraph": "Test on perception DC 10 Wisdom",
      "HowManyOptions": 2,
      "NextParagraph": [
        {
          "ChoiceText": "False",
          "IdParagraph": 10
        },
        {
          "ChoiceText": "True",
          "IdParagraph": 11
        }
      ]
    }
  ]}